{
  "status": "success",
  "totalResults": 23291,
  "results": [
    {
      "article_id": "80de680a6e90473028e356acd3531de7",
      "title": "Tragedy as 3-Month-Old Boy Is Killed by Family's Exotic Pet - This Could Have Easily Been Avoided",
      "link": "https://www.westernjournal.com/tragedy-3-month-old-boy-killed-familys-exotic-pet-easily-avoided/",
      "keywords": [
        "Commentary",
        "Alabama",
        "Animals",
        "Children",
        "Death",
        "Pets"
      ],
      "creator": [
        "C. Douglas Golden"
      ],
      "video_url": null,
      "description": "Almost every parent will tell you that the very first moment they laid eyes upon their child, they realized just how exponentially their level of responsibility had expanded. Not only […] The post Tragedy as 3-Month-Old Boy Is Killed by Family's Exotic Pet - This Could Have Easily Been Avoided appeared first on The Western Journal.",
      "content": "Almost every parent will tell you that the very first moment they laid eyes upon their child, they realized just how exponentially their level of responsibility had expanded. Not only were they responsible for the safety, well-being and future of themselves or their partner, they now were responsible for doing that for a virtually helpless human being they were now charged with raising to adulthood to be a conscientious member of a functioning society. Note the caveat there: . Every once in a while, one comes across a story that, as a mother or father, sickens and discomfits you because of the arrant lack of responsibility. Such is the case in Shelby County, Alabama, where a 3-month-old baby is dead thanks to an exotic pet no prudent parent would own. According to , in Chelsea, Alabama, the infant died on Thursday after a pet that was “described as a wolf-hybrid” by authorities tried “playing” with the while he was on the floor. EXOTIC PET KILLS BABY: The Shelby County Sheriff’s Office says a 3-month-old baby in Alabama died after being bitten by a “wolf-hybrid” kept as the family’s pet. — Local 3 News (@Local3News) The Shelby County Coroner and the Shelby County Sheriff’s Department are now investigating. “On Thursday, November 30, 2023, at approximately 12:54 pm Shelby County 911 received an emergency call reporting an animal attack involving an infant at a residence in the area of County Road 440 in Chelsea,” the said in a media release Friday. “Shelby County deputies, Chelsea firefighters, and Shelby County Animal Control Officers responded to the scene. The infant was transported to an area hospital by ambulance, with a law enforcement escort. “Upon arrival at the hospital, the infant was pronounced dead due to injuries suspected to have been caused by the animal. The animal is described as a wolf-hybrid and was reportedly kept as a pet by the family of the infant,” the news release continued. “The animal was euthanized at the scene by an area Vet, at the request of law enforcement, and has been transported to the Alabama State Diagnostics Laboratory in Auburn for further examination and investigation. There is no threat to the public. The Shelby County Sheriff’s Office is currently investigating the circumstances that led to the death of the infant.” WBRC reported the Shelby County Coroner said that, “according to the parents, the baby was on the floor and the wolf-hybrid picked up the baby and started playing with him. They stated the parents tried to get the baby from the wolf-hybrid, but it was too late.” “Its just unthinkable that this could happen to this baby,” Chelsea Mayor Tony Picklesimer said. “If you choose to own an exotic pet, what comes with that is additional responsibility to be sure that not only your family is safe, but your neighbors are safe.” Now, to be fair, WBRC also reported that it’s unclear just how much the family knew about . “Amy Byrd, a wolf-hybrid expert told WBRC the only way to truly know if you own a wolf-hybrid is through an extensive DNA test,” the station reported. “Byrd said true wolf-hybrids are rare and she doesn’t believe there are that many here in Alabama. [Eighty] to 90 percent of the wolf-hybrids Byrd sees in Alabama are actually multi-generation northern K-9 breeds. In many cases, these animals are sold to inexperienced homes that have not done the proper research on the animals.” However, it’s also safe to say that, if the Shelby County Sheriff’s Office was describing the animal as a “wolf-hybrid” with some certainty the day the animal killed the infant, there was no “extensive DNA test[ing]” done upon the animal; someone involved clearly knew what they were dealing with. Furthermore, as Byrd noted, any canine of sufficient strength and problematic temperament is capable of doing harm to a child. “And when you mix that with an ancient breed like a wolf dog, you have an animal with extreme intelligence, a lot of athletic ability and the tendency to want to escape,” she said. Mayor Picklesimer asked that those on social media exercise kindness toward the family while seemingly blaming the state’s laws for the loss. “Alabama is one of four states in the United States that does not have a code against exotic animals,” he said. “Once they get a taste, nature takes over, and it’s just very sad.” One can indeed have sympathy for this family’s loss without believing that Alabama’s state code regarding “ ” is to blame. Again, it’s murky what this family knew about this dog being a “wolf-hybrid” — or, according to the expert WBRC quoted, whether it actually a “true wolf-hybrid” and not one of many “multi-generation northern K-9 breeds” — but one can surmise that they had a dangerous pet that was not a run-of-the-mill dog. It killed their child. It doesn’t take much to do the math and realize there was likely a gross abdication of parental responsibility here. Absent some piece of exculpatory evidence so wild one would have to construct a mind-bogglingly elaborate scenario to introduce it, there’s no excuse for this exotic pet being around a child. Period. They were responsible for the safety of a virtually helpless ; even if they thought this was just some kind of dog, it was still a dog that quite obviously did not belong anywhere near their child. Whether or not this merits charges is a matter for law enforcement, but the fact remains that this death almost certainly could have been avoided by exercising elementary parental responsibility. We are committed to truth and accuracy in all of our journalism. For more A.F. Branco cartoons, go to WesternJournal.com/cartoons.",
      "pubDate": "2023-12-06 15:43:11",
      "image_url": null,
      "source_id": "westernjournal",
      "source_priority": 48043,
      "country": [
        "united states of america"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "8d45e40a84a12c7664079051e91ad69e",
      "title": "Senate progressives demand Biden reduce Gaza civilian deaths caused by US weapons",
      "link": "https://www.wsav.com/hill-politics/senate-progressives-demand-biden-reduce-gaza-civilian-deaths-caused-by-us-weapons/",
      "keywords": [
        "Politics from The Hill"
      ],
      "creator": [
        "Alexander Bolton",
        "The Hill"
      ],
      "video_url": null,
      "description": "A group of progressive Senate Democrats led by Sen. Elizabeth Warren (D-Mass.) are pressing President Biden and his administration to step up oversight of the use of U.S. military weapons by Israel Defense Forces (IDF) in Gaza to reduce the civilian death toll. In a letter to President Biden Tuesday, the senators raised alarm [...]",
      "content": "A group of progressive Senate Democrats led by Sen. Elizabeth Warren (D-Mass.) are pressing President Biden and his administration to step up oversight of the use of U.S. military weapons by Israel Defense Forces (IDF) in Gaza to reduce the civilian death toll. In a letter to President Biden Tuesday, the senators raised alarm over Israeli forces firing 155mm artillery shells, which are unguided explosive weapons that have a kill radius of between 100 and 300 meters, close to densely populated civilian areas. “The IDF has previously used these shells to ‘hit populated areas including neighborhoods, hospitals, schools, shelters and safe zones,’ causing a staggering number of civilian deaths,” they wrote , noting that more than 30 U.S.-based civil society groups warned Secretary of Defense Lloyd Austin against providing those shells to Israel. They circulated the letter ahead of a key procedural Senate vote Wednesday to begin debate on a $110 billion emergency foreign aid package that includes $14 billion in aid to Israel. Israel launched an offensive against Hamas in Gaza after the U.S.-designated terrorist group launched at attack on Oct. 7 that killed about 1,200 people. The civilian death toll in Gaza is estimated at around 15,000, according to the health ministry there. One of the letter’s signatories, Sen. Bernie Sanders (I-Vt.), has already said he will oppose more military aid to Israel without conditions to limit civilian casualties. Senate Republicans say they will block the bill because it does not include immigration and asylum policy reforms to reduce the flow of migrants across the U.S.-Mexico border. The Democratic senators who signed the letter to Biden cited press reports that the Defense Department only sent one Marine Corps general to advise Israel on how to mitigate civilian casualties and that U.S. military officials have yet to define safeguards or say how Israel should use U.S. weapons. “Civilian harm prevention is a cornerstone of American foreign policy, and U.S. policy and international law requires that American weapons transferred to foreign governments, including Israel, are used in a manner consistent with protecting civilian lives,” they wrote. They expressed “concerns” over what they called “insufficient transparency around weapons transfers to Israel” because Israel is allowed to use Foreign Military Financing from the United States to buy U.S. weapons directly from domestic arms manufactures, which only requires classified notifications of those sales to a few members of the Senate Foreign Relations and House Foreign Affairs Committees. They pointed out that United Nations Secretary General António Guterres has called the strikes on civilian areas “clear violations of international humanitarian law.” The senators note that Biden’s request for military aid to Israel asks Congress to waive notification requirements. They say this would further limit congressional oversight and harm “our ability to monitor and determine whether U.S. assistance is contributing to disproportionate civilian harm.” They argue that lawmakers are in the dark about what role U.S. weapons have played in killing Palestinian civilians because Israeli forces have restricted independent human rights groups and media organizations from visiting Gaza. “Your administration must ensure that existing guidance and standards are being used to evaluate the reports of Israel using U.S. weapons in attacks that harm civilians in order to more rigorously protect civilian safety during Israel’s operations in Gaza,” the senators wrote. Warren and her colleagues concluded their letter with more than a dozen questions about what steps the Pentagon has taken to reduce civilian casualties. They want to know if U.S. officials are aware of the Israel Defense Force’s policy on preventing civilian harm, what insights the U.S. government has about how Israel assesses the proportionality of civilian deaths and whether the Israel has a system for reporting allegations of civilian harm. They asked what systems Israel has in place to investigate allegations of civilian harm and what training the U.S. has provided to Israeli troops to prevent civilian deaths.",
      "pubDate": "2023-12-06 15:42:51",
      "image_url": "https://www.wsav.com/wp-content/uploads/sites/75/2023/12/warrenelizabeth_110723gn01_w.jpg?w=900",
      "source_id": "wsav",
      "source_priority": 20098,
      "country": [
        "united states of america"
      ],
      "category": [
        "politics"
      ],
      "language": "english"
    },
    {
      "article_id": "ea9f158696d5975dbcbcbfba6daf2e4b",
      "title": "Senate progressives demand Biden reduce Gaza civilian deaths caused by US weapons",
      "link": "https://thehill.com/homenews/senate/4345041-senate-progressives-biden-gaza-civilian-deaths-us-weapons/",
      "keywords": [
        "Senate",
        "Defense",
        "News",
        "Policy"
      ],
      "creator": [
        "Alexander Bolton"
      ],
      "video_url": null,
      "description": "A group of progressive Senate Democrats led by Sen. Elizabeth Warren (D-Mass.) are pressing President Biden and his administration to step up oversight of the use of U.S. military weapons by Israel Defense Forces (IDF) in Gaza to reduce the civilian death toll. In a letter to President Biden Tuesday, the senators raised alarm...",
      "content": "A group of progressive Senate Democrats led by Sen. Elizabeth Warren (D-Mass.) are pressing President Biden and his administration to step up oversight of the use of U.S. military weapons by Israel Defense Forces (IDF) in Gaza to reduce the civilian death toll. In a letter to President Biden Tuesday, the senators raised alarm over Israeli forces firing 155mm artillery shells, which are unguided explosive weapons that have a kill radius of between 100 and 300 meters, close to densely populated civilian areas. “The IDF has previously used these shells to ‘hit populated areas including neighborhoods, hospitals, schools, shelters and safe zones,’ causing a staggering number of civilian deaths,” , noting that more than 30 U.S.-based civil society groups warned Secretary of Defense Lloyd Austin against providing those shells to Israel. They circulated the letter ahead of a key procedural Senate vote Wednesday to begin debate on a $110 billion emergency foreign aid package that includes $14 billion in aid to Israel. Israel launched an offensive against Hamas in Gaza after the U.S.-designated terrorist group launched at attack on Oct. 7 that killed about 1,200 people. The civilian death toll in Gaza is estimated at around 15,000, according to the health ministry there. One of the letter’s signatories, Sen. Bernie Sanders (I-Vt.), has already said he will oppose more military aid to Israel without conditions to limit civilian casualties. Senate Republicans say they will block the bill because it does not include immigration and asylum policy reforms to reduce the flow of migrants across the U.S.-Mexico border. The Democratic senators who signed the letter to Biden cited press reports that the Defense Department only sent one Marine Corps general to advise Israel on how to mitigate civilian casualties and that U.S. military officials have yet to define safeguards or say how Israel should use U.S. weapons. “Civilian harm prevention is a cornerstone of American foreign policy, and U.S. policy and international law requires that American weapons transferred to foreign governments, including Israel, are used in a manner consistent with protecting civilian lives,” they wrote. They expressed “concerns” over what they called “insufficient transparency around weapons transfers to Israel” because Israel is allowed to use Foreign Military Financing from the United States to buy U.S. weapons directly from domestic arms manufactures, which only requires classified notifications of those sales to a few members of the Senate Foreign Relations and House Foreign Affairs Committees. They pointed out that United Nations Secretary General António Guterres has called the strikes on civilian areas “clear violations of international humanitarian law.” The senators note that Biden’s request for military aid to Israel asks Congress to waive notification requirements. They say this would further limit congressional oversight and harm “our ability to monitor and determine whether U.S. assistance is contributing to disproportionate civilian harm.” They argue that lawmakers are in the dark about what role U.S. weapons have played in killing Palestinian civilians because Israeli forces have restricted independent human rights groups and media organizations from visiting Gaza. “Your administration must ensure that existing guidance and standards are being used to evaluate the reports of Israel using U.S. weapons in attacks that harm civilians in order to more rigorously protect civilian safety during Israel’s operations in Gaza,” the senators wrote. Warren and her colleagues concluded their letter with more than a dozen questions about what steps the Pentagon has taken to reduce civilian casualties. They want to know if U.S. officials are aware of the Israel Defense Force’s policy on preventing civilian harm, what insights the U.S. government has about how Israel assesses the proportionality of civilian deaths and whether the Israel has a system for reporting allegations of civilian harm. They asked what systems Israel has in place to investigate allegations of civilian harm and what training the U.S. has provided to Israeli troops to prevent civilian deaths.",
      "pubDate": "2023-12-06 15:41:41",
      "image_url": "https://thehill.com/wp-content/uploads/sites/2/2023/11/warrenelizabeth_110723gn01_w.jpg?w=900",
      "source_id": "thehill",
      "source_priority": 393,
      "country": [
        "united states of america"
      ],
      "category": [
        "politics"
      ],
      "language": "english"
    },
    {
      "article_id": "e48e4a7ccbedfb4cd0028e69b6fe6afc",
      "title": "4th GOP debate airs tonight",
      "link": "https://www.wsav.com/news/washington/4th-gop-debate-airs-tonight/",
      "keywords": [
        "Washington"
      ],
      "creator": [
        "Trevor Shirley"
      ],
      "video_url": null,
      "description": "Four qualifying presidential candidates will face each other again, but the GOP’s lead contender will be nowhere near the debate stage.",
      "content": "WASHINGTON (NEXSTAR) – Four qualifying presidential candidates will face each other again, but the GOP’s lead contender will be nowhere near the debate stage. Former New Jersey Governor Chris Christie, Florida Governor Ron DeSantis, former U.N. ambassador Nikki Haley, and entrepreneur Vivek Ramaswamy will face off at the University of Alabama in Tuscaloosa. “We’ve been preparing for days and days. We’ve had an entire team here working on all the research for weeks,” said debate moderator Elizabeth Vargas. She points out its one of the candidates’ final chances to pitch themselves to a national audience before January’s Iowa caucus. Looming above all four candidates on stage, former president Donald Trump, the GOP’s leading contender for the presidential nomination, who is again skipping a presidential debate, meaning more focus on those present. Debate moderator Megan Kelly says, “Fewer candidates mean much higher stakes they’re not going to be able to give 30 second answers and move on they’re going to need to go below surface level every single topic.” With topics ranging from the economy, inflation, border control and the wars in Israel and Ukraine, moderators say tonight will matter to primary voters especially any that are undecided. Tonight’s debate airs on 24-hour cable network News Nation and your local CW station.",
      "pubDate": "2023-12-06 15:41:13",
      "image_url": "https://www.wsav.com/wp-content/uploads/sites/75/2023/12/vlcsnap-2023-12-05-09h30m17s151-2.jpg?w=900",
      "source_id": "wsav",
      "source_priority": 20098,
      "country": [
        "united states of america"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "98cec49080439e21526c7675c56208bb",
      "title": "Taylor Swift lambasts music industry and says Kim Kardashian feud ‘took me down psychologically’",
      "link": "https://www.theguardian.com/music/2023/dec/06/taylor-swift-lambasts-music-industry-and-says-kim-kardashian-feud-took-me-down-psychologically",
      "keywords": [
        "Taylor Swift",
        "Music",
        "Pop and rock",
        "Culture",
        "US news",
        "Kim Kardashian",
        "Kanye West",
        "Time magazine",
        "Magazines",
        "Media",
        "Life and style"
      ],
      "creator": [
        "Ben Beaumont-Thomas"
      ],
      "video_url": null,
      "description": "In a lengthy interview as she is named Time’s person of the year, Swift speaks about toll of high-profile spat, and criticises music industry over treatment of young starsTaylor Swift has spoken of the psychological damage of her feud with Kim Kardashian and Kanye West, and lambasted the music industry over its treatments of young pop stars, in a new interview with Time, which has named her their person of the year.After a year in which she has been at the centre of cultural conversations for her massively lucrative Eras tour, Swift spoke damningly of what she sees as a short-termist approach by record labels to replace, rather than nurture its stars. “By the time an artist is mature enough to psychologically deal with the job, they throw you out at 29, typically,” she says. “In the 90s and 00s, it seems like the music industry just said: ‘OK, let’s take a bunch of teenagers, throw them into a fire, and watch what happens. By the time they’ve accumulated enough wisdom to do their job effectively, we’ll find new teenagers.’” She said her solution was to change style with each new album project: “I realised every record label was actively working to try to replace me. I thought instead, I’d replace myself first with a new me. It’s harder to hit a moving target.” Continue reading...",
      "content": "Taylor Swift has spoken of the psychological damage of her feud with Kim Kardashian and Kanye West, and lambasted the music industry over its treatments of young pop stars, in a new interview with Time, which has named her their person of the year. After a year in which she has been at the centre of cultural conversations for her massively lucrative Eras tour, Swift spoke damningly of what she sees as a short-termist approach by record labels to replace, rather than nurture its stars. “By the time an artist is mature enough to psychologically deal with the job, they throw you out at 29, typically,” she says. “In the 90s and 00s, it seems like the music industry just said: ‘OK, let’s take a bunch of teenagers, throw them into a fire, and watch what happens. By the time they’ve accumulated enough wisdom to do their job effectively, we’ll find new teenagers.’” She said her solution was to change style with each new album project: “I realised every record label was actively working to try to replace me. I thought instead, I’d replace myself first with a new me. It’s harder to hit a moving target.” She was particularly critical of Big Machine, the label she released her first six albums with and which she accuses of keeping her on a tight artistic leash. “Every creative choice I wanted to make was second-guessed,” she said. “I was really overthinking these albums.” That working relationship ended in huge acrimony, with Swift opposed to the transferral of ownership of the Big Machine albums to music manager Scooter Braun, with whom she had clashed. “My masters were being sold to someone who actively wanted them for nefarious reasons, in my opinion,” she told Time. Braun has not commented on the interview, but has previously said “a lot of things got lost in translation” in the deal and the circus around it: “I thought it was unfair, but I also understand, from the other side, they probably felt it was unfair, too.” Swift’s animosity towards Braun dates to when he managed Kanye West . West released a song, Famous, featuring the lyric: “I made that bitch famous”, referring to a previous spat between the pair. Swift publicly opposed the Famous lyric, but was criticised after Kim Kardashian, West’s then-wife, leaked a phone call recording between West and Swift in which Swift seemed to have approved the song. A longer version of the video vindicated Swift by showing she hadn’t approved the “bitch” line. ‘A goth-punk moment of female rage’ … Swift performing during her Reputation tour. Photograph: Rick Scuteri/Invision/AP The feud dominated the tabloid press and social media for years, and damaged Swift’s reputation (which she alluded to with the title of her sixth album). “My career was taken away from me,” she says in her Time interview. “You have a fully manufactured frame job, in an illegally recorded phone call, which Kim Kardashian edited and then put out to say to everyone that I was a liar. That took me down psychologically to a place I’ve never been before. I moved to a foreign country. I didn’t leave a rental house for a year. I was afraid to get on phone calls. I pushed away most people in my life because I didn’t trust anyone any more. I went down really, really hard.” Kardashian has not commented, but said in 2020: “Nobody ever denied the word ‘bitch’ was used without her permission … I never edited the footage (another lie) – I only posted a few clips on Snapchat to make my point”, adding that Swift “forced me to defend [West]”. Swift spoke proudly about 2017’s Reputation – which was seen by some as a failure on release but is now much championed by Swift fans – calling it “a goth-punk moment of female rage at being gaslit by an entire social structure”. Elsewhere in her Time interview she discusses her much-scrutinised love life with NFL player Travis Kelce, the ongoing project to re-record her Big Machine-era albums, and addresses the comparisons between her Eras and Beyoncé’s Renaissance tours, which have both produced popular concert films. “Clearly it’s very lucrative for the media and stan culture to pit two women against each other,” she says. More broadly, she said the current popularity of female pop stars – 2024’s Grammy nominations are dominated by female artists – was cheering. “If we’re going to look at this in the most cynical way possible, feminine ideas becoming lucrative means that more female art will get made. It’s extremely heartening.”",
      "pubDate": "2023-12-06 15:40:35",
      "image_url": "https://i.guim.co.uk/img/media/9677719122d22bf0b76515658bedef206f6cdee5/0_200_4725_2835/master/4725.jpg?width=140&quality=85&auto=format&fit=max&s=84ade72133b14f85bec7adb8773856e5",
      "source_id": "theguardian",
      "source_priority": 106,
      "country": [
        "united states of america"
      ],
      "category": [
        "entertainment"
      ],
      "language": "english"
    },
    {
      "article_id": "9280df4d591799dd2244a1eaf28e0ec7",
      "title": "Germany 'Not Ukraine's Ally,' Top Official Says",
      "link": "https://www.newsweek.com/ukraine-germany-russia-pistorius-1850016",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "German defense minister Boris Pistorius has acknowledged delays in Berlin supplying weapons to Kyiv.",
      "content": "Germany's defense minister Boris Pistorius has said that his country is doing everything it can to help Ukraine fight Russian aggression but noted that Kyiv was not an ally of Berlin. The comments by Pistorius during a television interview follow accusations that Berlin has been reluctant to provide military support for Ukraine to use in the war started by . Tom O'Donnell, a geopolitical analyst based in Berlin, told that Pistorius wants to see Ukraine get more weapons from Germany and the but may face opposition from within his government. \"Maybe Pistorius is serious about doing this but my impression is beyond whatever he wants to do, I don't think the government here has the will to really ramp this up,\" O'Donnell said. Despite pledging in November to double its military aid to Kyiv in 2024, Germany has been under fire for refusing to send its to Ukrainian forces despite the U.K. and France supplying similar long-range weapons. Berlin has supplied Ukraine with artillery, Leopard tanks, and Patriot air defense systems, ammunition, vehicles, drones and other weaponry. Pistorius defended his country's record as the second-largest supporter of Kyiv's forces after the U.S. \"We deliver what we can. The same applies to almost all other allies and partners. But Germany is not an ally of Ukraine and therefore not in an alliance,\" he told the broadcaster ZDG according to a translation, in comments widely reported by Ukrainian media. In July, said that Ukraine can join the alliance of which Germany is a key part, although it has not specified when. \"We currently have the problem that the arms industry cannot deliver in certain areas as quickly as the needs are there,\" Pistorius said, adding the defense industry is increasing capacity \"wherever it can.\" He gave the example that it took six months to restart production of ammunition for Leopard tanks. He also criticized the pledge made last year by the to increase its output of 155 mm shells to one million rounds of ammunition by spring, which \"raised expectations that ultimately could not be fulfilled.\" Ukrainian Foreign Minister Dmytro Kuleba confirmed in November that the EU was behind schedule. \"You can assume that things will get better in the next few months,\" Pistorius said, as Germany is set to deliver almost 200,000 rounds of ammunition. \"But everything takes time, and it's not a question of political decisions or financial resources.\" There is concern that as the war drags on, Ukraine's allies will balk at continuing to supply it with weapons, although Pistorius rejected the claim that the West did not want to see a full Ukrainian victory on the battlefield. \"We should be more afraid that Russia will win this war,\" he said, because it would mean that Germany will face \"a completely new security situation.\" has contacted the Ukrainian foreign ministry for comment. O'Donnell said that it was notable that Pistorius' comments about pushing for more weapons follow delays in upping production across Europe. \"The basic problem is that in the EU especially, everybody gave old weapons that were in storage and that's pretty much run out,\" he said. \"If they wanted to be producing weapons at a good pace, generally it takes a couple of years to ramp that up and they simply didn't.\" \"I think there's a real problem, and Pistorius would like to do something about it, but I'm not sure that the apparatus is there. I would say in the German Chancellor's office, in other places, there are people who would rather see a stalemate,\" O'Donnell said. \"My feeling is that to them, what's wrong with a stalemate? It means both sides can't advance, it's painful and now they'll talk.\" Newsweek is committed to challenging conventional wisdom and finding connections in the search for common ground. Newsweek is committed to challenging conventional wisdom and finding connections in the search for common ground.",
      "pubDate": "2023-12-06 15:38:43",
      "image_url": null,
      "source_id": "newsweek",
      "source_priority": 537,
      "country": [
        "united states of america"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "2794866a6fe8d93def0a08b59d6860db",
      "title": "Intel i5-13600KF CPU gets a hefty price in pre Christmas Amazon deal",
      "link": "https://www.videogamer.com/news/intel-i5-13600kf-cpu-gets-a-hefty-price-in-pre-christmas-amazon-deal/",
      "keywords": [
        "news"
      ],
      "creator": [
        "Bruce Dent"
      ],
      "video_url": null,
      "description": "Check out this discounted Intel CPU The post Intel i5-13600KF CPU gets a hefty price in pre Christmas Amazon deal appeared first on VideoGamer.",
      "content": "Video Gamer is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. The is a top pick if you’re after a powerful CPU for a variety of demanding tasks. It ranks as one of the GPU, offering great value for money over the slightly more powerful i9-13600KF CPU, and now it’s going for even less on Amazon. As Christmas gets nearer, we’re seeing some tasty discounts coming in from the likes of Intel and AMD, so it’s a great time to be looking for the . Intel Core i5-13600KF Best Deals Previously priced at $304, this CPU from Intel received a generous 18% discount on Amazon, meaning it’s now available for just $249.99. Next we will be getting into some of the key specs of this CPU to see if it’s the right fit for you. This powerful Intel Core i5-13600KF desktop processor is ready to deliver a highly efficient performance, whether it’s gaming or content creation. And now that it’s available with such an eye-catching discount, bringing it’s price down to just under $250, it offers an excellent price to performance ratio. It’s modern, as a 13th generation processor. With 14 cores and 20 threads, it’s a beastly CPU which can deliver under pretty much any circumstance. To get the most from this CPU deal, it’ll be worth investing in the . AMD Ryzen 7 5800X3D Best Deals Intel Core i5-13600KF Best Deals AMD Ryzen 7 5700X Best Deals AMD Ryzen 7 7800X3D Best Deals Intel Core i7 (12th Gen) Best Deals",
      "pubDate": "2023-12-06 15:38:18",
      "image_url": "https://www.videogamer.com/cdn-cgi/image/width=1258,height=1500,fit=crop,quality=80,format=auto,onerror=redirect,metadata=none/wp-content/uploads/Intel-core-i5-13600kfjpg.jpg",
      "source_id": "videogamer",
      "source_priority": 3329,
      "country": [
        "united states of america"
      ],
      "category": [
        "entertainment"
      ],
      "language": "english"
    },
    {
      "article_id": "ab35e835d810339342550c86e3a79183",
      "title": "Amazon deal slashes 49% off popular Ryzen 9 5900X gaming CPU",
      "link": "https://www.videogamer.com/news/amazon-deal-slashes-49-off-popular-ryzen-9-5900x-gaming-cpu/",
      "keywords": [
        "news"
      ],
      "creator": [
        "Bruce Dent"
      ],
      "video_url": null,
      "description": "Nearly half price for this powerhouse of a CPU The post Amazon deal slashes 49% off popular Ryzen 9 5900X gaming CPU appeared first on VideoGamer.",
      "content": "Video Gamer is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Are you looking for a powerful CPU capable of handling a variety of demanding tasks, such as gaming, streaming, and video editing? The is now available for nearly half the price on Amazon, and it’s certainly a popular choice among customers, with over 9,000 five star Amazon ratings. With Christmas rapidly approaching, it’s an ideal time to be on the look out for the as the discounts start to roll in. The Ryzen 5000-series CPUs are a few years old now, but they still deliver a strong performance and contend with the . So, if you’re looking in a higher price range, then we’ve got you covered on the . AMD Ryzen 9 5900X Best Deals This AMD Ryzen CPU is now up for grabs for just $288.99 after it’s initially listed price of $569.99 was slashed by 49% on Amazon. Let’s take a closer look at some of the key specs to see if this CPU meets your needs. This AMD Ryzen 9 5900X promises to deliver a high performance for gaming, streaming, and much more. And now that you can get it for below $300, we think it offers great value for money. It boasts 12 cores and 24 processing threads, and a max boost clock reaching 4.8GHz. The only drawback in this deal is that this CPU uses a slightly outdated socket, the AM4 platform. It’s worth having a look at the if you haven’t already got one and are considering this deal. AMD Ryzen 7 5800X3D Best Deals Intel Core i5-13600KF Best Deals AMD Ryzen 7 5700X Best Deals AMD Ryzen 7 7800X3D Best Deals Intel Core i7 (12th Gen) Best Deals",
      "pubDate": "2023-12-06 15:38:10",
      "image_url": "https://www.videogamer.com/cdn-cgi/image/width=866,height=928,fit=crop,quality=80,format=auto,onerror=redirect,metadata=none/wp-content/uploads/616VM20AzL._AC_SL1384_-3.jpg",
      "source_id": "videogamer",
      "source_priority": 3329,
      "country": [
        "united states of america"
      ],
      "category": [
        "entertainment"
      ],
      "language": "english"
    },
    {
      "article_id": "5fd7fc13e0c41de047bb6ca2e984e025",
      "title": "Learning Losses Recorded Across Developed Nations in Wake of Pandemic",
      "link": "https://www.theepochtimes.com/us/learning-losses-recorded-across-developed-nations-in-wake-of-pandemic-5542062",
      "keywords": [
        "Education & Family News",
        "US",
        "World News",
        "COVID-19 pandemic",
        "learning"
      ],
      "creator": [
        "Katabella Roberts"
      ],
      "video_url": null,
      "description": "Teenagers in developed nations including the United States have seen a decline in their reading and math test scores, which experts attribute in part to learning loss during the COVID-19 pandemic, according to data published on Dec. 5. The Organization for Economic Cooperation and Development (OECD) Programme for International Student Assessment (PISA) examines what students […]",
      "content": "Teenagers in developed nations including the United States have seen a decline in their reading and math test scores, which experts attribute in part to learning loss during the COVID-19 pandemic, according to data published on Dec. 5. The Organization for Economic Cooperation and Development (OECD) Programme for International Student Assessment (PISA) examines what students know in mathematics, reading, and science, and what they can do with the knowledge they have, via annual tests. PISA typically conducts the testing every three years but the planned 2021 test was postponed because of the pandemic. In 2022, as nations were still dealing with the ongoing impacts of the pandemic, nearly 700,000 students from 81 OECD member and partner economies—representing 29 million across the world—took the PISA test, which was administered among 15-year-olds. Results from the latest assessment found, on average, an \"unprecedented drop in performance across the OECD\" members and partner economies, which include Australia, Canada, the United States, the United Kingdom, and Germany, among others. When compared to 2018, mean performance across participating nations in reading fell by 10 points and nearly 15 points in mathematics, which is equivalent to three-quarters of a year's worth of learning, according to the findings. How Scholars, Parents Are Fighting the ‘Communist Education Deep State’ UC Professors Oppose Call for 'Viewpoint-Neutral' Middle East History Education The decline in mathematics scores is three times greater than any previous consecutive change, according to the assessment. When it comes to science, however, scores changed little since 2018, according to the latest findings. Still, the latest results have sparked concern among the OECD, which noted that 1 in 4 of the students tested are now considered to be low-performers in mathematics, reading, and science on average across OECD countries. The average math score among American teens fell by 13 points between 2019 and 2022, compared with a decline of 15 points for the typical country in the OECD. Reading and science stayed mostly even, a trend that was mainly seen among OECD countries overall. \"Learning loss due to the pandemic was a global phenomenon,” said Martin West, the academic dean at Harvard Graduate School of Education, in a statement. \"We’ve never seen, in an international assessment, consistent declines across a large number of school systems in the way we see here.” Elsewhere, the assessment found that Albania saw the greatest decrease in math scores, with a decline of 69 points. That was followed by Jordan, with 39 points, and Iceland, with 36. However, the findings also raised concerns among nations including Germany, Iceland, and the Netherlands, which saw drops of 25 points or more in math scores. Twenty points is roughly equivalent to a year’s worth of learning. Singapore had the highest scores by far across all three subjects while several nations, including Canada, Estonia, and Japan also performed better than average on all three exams. For example, nations including Belgium, Canada, Czechia, Finland, France, Hungary, Iceland, the Netherlands, New Zealand, and Slovakia had already been experiencing negative trends in math performance prior to 2018, OECD noted. \"The relationship between pandemic-induced school closures, often cited as the main cause of performance decline is not so direct. Across the OECD, around half of the students experienced closures for more than three months,\" the OECD wrote in its assessment. \"However, PISA results show no clear difference in performance trends between education systems with limited school closures such as Iceland, Sweden, and Chinese Taipei, and systems that experienced longer school closures, such as Brazil, Ireland, and Jamaica,\" they continued. Overall, the OECD noted a strong connection between investment in education and average performance, along with parental engagement and teacher support in student learning. \"PISA data shows that teachers’ support is particularly important in times of disruption, including by providing extra pedagogical and motivational support to students. The availability of teachers to help students in need had the strongest relationship to mathematics performance across the OECD, compared to other experiences linked to COVID-19 school closure,\" the OECD wrote. \"These students were also more confident than their peers to learn autonomously and remotely.\" Despite this, just 1 in 5 students overall reported that they received extra help from teachers in some of their mathematics lessons last year, while about 8 percent said they never or almost never received additional support, according to the assessment.",
      "pubDate": "2023-12-06 15:38:07",
      "image_url": null,
      "source_id": "theepochtimes",
      "source_priority": 10731,
      "country": [
        "united states of america"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "838eda0f6dc7290ffd0075633ca3ba3c",
      "title": "Hacienda convoca el CPFF el día 11 para aprobar la nueva senda de déficit autonómico",
      "link": "https://www.infobae.com/espana/agencias/2023/12/06/hacienda-convoca-el-cpff-el-dia-11-para-aprobar-la-nueva-senda-de-deficit-autonomico/",
      "keywords": null,
      "creator": [
        "Newsroom Infobae"
      ],
      "video_url": null,
      "description": null,
      "content": "06 Dic, 2023 10:38 a.m. EST Compartir Compartir articulo Copiar enlace Facebook Twitter Whatsapp Linkedin Telegram E-mail Madrid, 6 dic (EFECOM).- El Ministerio de Hacienda ha convocado al Consejo Política y Fiscal y Financiero (CPFF) el 11 de diciembre para aprobar la nueva senda de déficit que tendrán la comunidades autónomas de cara a los Presupuestos Generales del Estado de 2024, que el Gobierno quiere tener listos en el primer trimestre del próximo año. Se trata de un paso importante para continuar con la marcha de los próximos presupuestos generales, aunque el Consejo de Ministros deberá aprobar también el techo de gasto y los objetivos de déficit de los próximos años. Las instrucciones para elaborar las nuevas cuentas ya están aprobadas y el Gobierno tiene que diseñar una senda de estabilidad -que según avanzó a Bruselas en octubre pasa por bajar el déficit al 3 % del PIB en 2024- y proyectarla en el techo de gasto, que es la pieza clave para la confección de las futuras cuentas. El CPFF se celebra el mismo día en que se cumple la fecha para que los diferentes ministerios envíen sus propuestas presupuestarias a Hacienda. Ese lunes la vicepresidenta cuarta y ministra de Hacienda, María Jesús Montero, llevará una senda de déficit desglosada para fijar los objetivos de las comunidades autónomas, de la Seguridad Social y del Estado, y aunque se opongan los gobiernos del PP el Ejecutivo tiene voto de calidad para su aprobación definitiva. De acuerdo con la ley de estabilidad presupuestaria, esta senda tiene que enviarse a las Cortes para su aprobación en ambas cámaras, donde el Gobierno se encuentra con un gran obstáculo: el PP tiene mayoría absoluta en el Senado y no parece dispuesto a avalar los objetivos de déficit. Sin embargo, fuentes cercanas al Ministerio de Hacienda han señalado que, aunque el Senado \"tumbe\" los objetivos de déficit, \"se formularán los presupuestos porque tenemos el respaldo de la seguridad jurídica\". Hacienda descarta \"ahora mismo\" una reforma de la Ley de Estabilidad que permitiría sortear el veto del Senado a la senda de déficit, aunque reconoce que debe hacerse en un futuro. Fuentes del ministerio están convencidos de saldrán los presupuestos de 2024 y recuerdan que los objetivos vienen pactados por Bruselas, al tiempo que apuntan que sin unos Presupuestos Generales las comunidades autónomas no pueden hacer sus cuentas regionales. Una vez que los presupuestos estén encaminados, de forma paralela se intentará modificar el modelo de financiación autonómica, aunque fuentes cercanas a Montero señalan que sí o sí tiene que entrar el PP. \"Feijóo debe abrir esa posibilidad\", recalcan al tiempo que lamentan que presidentes autonómicos como Isabel Díaz Ayuso, en Madrid, el presidente de la Xunta, Alfonso Rueda, y el presidente de la Junta de Andalucía, Juan Manuel Moreno, \"estén en posiciones de máximos y no quieren ceder\". EFECOM rdm/lml/jla Temas Relacionados EFE Más Noticias ¿Puedo cancelar el envío de dinero en Bizum si me he equivocado? Un total de 34 bancos en España ofrecen este sistema de pago, que permite realizar transferencias de hasta 500 euros en tan solo unos segundos Los bancos españoles ofrecen la mayor rentabilidad de la UE en cuentas de ahorro remuneradas El interés medio que dan las entidades españolas es del 2,42% frente al 0,35% de su competencia de la eurozona Las mejores anécdotas de Ramón García en las Campanadas de TVE: del origen de su capa a ‘las Tanga-nadas’ con Anne Igartiburu El mítico presentador regresa a la Puerta del Sol de la mano de TVE este próximo 31 de diciembre para dar la bienvenida al nuevo año Un hospital español incorpora una técnica novedosa de mastectomía contra el cáncer de mama Es menos invasiva, menos dolorosa y más estética que la técnica quirúrgica regular Sánchez y Feijóo se reunirán antes de fin de año para tratar la renovación del CGPJ El presidente del Gobierno ha trasladado en el Congreso su intención de llamar al líder popular para negociar esta y otras cuestiones pendientes, y los de Feijóo afirman que recogerán el guante MÁS NOTICIAS",
      "pubDate": "2023-12-06 15:38:05",
      "image_url": null,
      "source_id": "infobae",
      "source_priority": 2486,
      "country": [
        "colombia",
        "argentina",
        "mexico",
        "united states of america"
      ],
      "category": [
        "top"
      ],
      "language": "spanish"
    }
  ],
  "nextPage": "1701877085471794430"
}